In [3]:
import pandas as pd
import csv
import names

In [4]:
names_list = [["Abhi", "Jais"], ["Santosh", "sah"], ["gaurav", "mishra"]]

In [8]:
df = pd.DataFrame(names_list, columns=['first_name', 'last_name'])

In [12]:
print(df.to_csv(sep=',', index=False))

first_name,last_name
Abhi,Jais
Santosh,sah
gaurav,mishra

In [13]:
df.to_csv('sample.csv', index=False, sep=',')

In [23]:
a = {"Abhishek jaiswal"}

In [24]:
for i in range(0,350000):
    a.add(str(names.get_full_name()))

In [25]:
names_list = []
for n in a:
    names_list.append(n.split())

In [26]:
df = pd.DataFrame(names_list, columns=['first_name', 'last_name'])

In [20]:
df

     first_name  last_name
0         Wanda    Richard
1     Christian   Williams
2         Elise      Blaze
3      Abhishek    jaiswal
4       Phyllis  Singleton
5         Roman     Teague
6           Ana      Oneil
7        Agatha    Douglas
8       Michael      Price
9       Barbara       Nhek
10  Christopher      Gokey

In [27]:
df.to_csv('mydata.csv', index=False, sep=',')

In [28]:
len(a)

296533